tap "hashicorp/tap"
brew "python@3.13"
brew "awscli"
brew "bento4"
brew "direnv"
brew "dnsmasq"
brew "exiftool"
brew "ffmpeg"
brew "fio"
brew "fnm"
brew "gh"
brew "tesseract"
brew "ghostscript"
brew "git"
brew "grafana"
brew "httpie"
brew "iftop"
brew "imagemagick"
brew "jq"
brew "media-info"
brew "nmap"
brew "node"
brew "pipx"
brew "poppler"
brew "postgresql@16"
brew "pre-commit"
brew "prometheus"
brew "pyenv"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "s5cmd"
brew "telnet"
brew "tmux"
brew "uv"
brew "watch"
brew "yq"
brew "yt-dlp"
brew "hashicorp/tap/terraform"
cask "claude-code"
cask "codex"
cask "docker-desktop"
cask "mediainfo"
cask "ngrok"
cask "visual-studio-code"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "xyz.local-history"
