amazonwebservices.amazon-q-vscode
amazonwebservices.aws-toolkit-vscode
anthropic.claude-code
charliermarsh.ruff
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
google.geminicodeassist
googlecloudtools.cloudcode
humao.rest-client
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
openai.chatgpt
rangav.vscode-thunder-client
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
usernamehw.errorlens
xyz.local-history
